-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Окт 23 2019 г., 18:26
-- Версия сервера: 5.6.43
-- Версия PHP: 7.1.22

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `classmate`
--

-- --------------------------------------------------------

--
-- Структура таблицы `classes`
--

CREATE TABLE `classes` (
  `_id` int(11) NOT NULL,
  `class` varchar(4) NOT NULL,
  `school_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `classes`
--

INSERT INTO `classes` (`_id`, `class`, `school_id`) VALUES
(1, '1а', 0),
(2, '1б', 0),
(3, '1в', 0),
(4, '1г', 0),
(5, '1д', 0),
(6, '1е', 0),
(7, '1ё', 0),
(8, '1ж', 0),
(9, '1з', 0),
(10, '1и', 0),
(11, '1й', 0),
(12, '1к', 0),
(13, '1л', 0),
(14, '1м', 0),
(15, '1н', 0),
(16, '1о', 0),
(17, '1п', 0),
(18, '1р', 0),
(19, '1с', 0),
(20, '1т', 0),
(21, '1у', 0),
(22, '1ф', 0),
(23, '1х', 0),
(24, '1ц', 0),
(25, '1ч', 0),
(26, '1ш', 0),
(27, '1ц', 0),
(28, '1ъ', 0),
(29, '1ы', 0),
(30, '1ь', 0),
(31, '1э', 0),
(32, '1ю', 0),
(33, '1я', 0),
(34, '2а', 0),
(35, '2б', 0),
(36, '2в', 0),
(37, '2г', 0),
(38, '2д', 0),
(39, '2е', 0),
(40, '2ё', 0),
(41, '2ж', 0),
(42, '2з', 0),
(43, '2и', 0),
(44, '2й', 0),
(45, '2к', 0),
(46, '2л', 0),
(47, '2м', 0),
(48, '2н', 0),
(49, '2о', 0),
(50, '2п', 0),
(51, '2р', 0),
(52, '2с', 0),
(53, '2т', 0),
(54, '2у', 0),
(55, '2ф', 0),
(56, '2х', 0),
(57, '2ц', 0),
(58, '2ч', 0),
(59, '2ш', 0),
(60, '2ц', 0),
(61, '2ъ', 0),
(62, '2ы', 0),
(63, '2ь', 0),
(64, '2э', 0),
(65, '2ю', 0),
(66, '2я', 0),
(67, '3а', 0),
(68, '3б', 0),
(69, '3в', 0),
(70, '3г', 0),
(71, '3д', 0),
(72, '3е', 0),
(73, '3ё', 0),
(74, '3ж', 0),
(75, '3з', 0),
(76, '3и', 0),
(77, '3й', 0),
(78, '3к', 0),
(79, '3л', 0),
(80, '3м', 0),
(81, '3н', 0),
(82, '3о', 0),
(83, '3п', 0),
(84, '3р', 0),
(85, '3с', 0),
(86, '3т', 0),
(87, '3у', 0),
(88, '3ф', 0),
(89, '3х', 0),
(90, '3ц', 0),
(91, '3ч', 0),
(92, '3ш', 0),
(93, '3ц', 0),
(94, '3ъ', 0),
(95, '3ы', 0),
(96, '3ь', 0),
(97, '3э', 0),
(98, '3ю', 0),
(99, '3я', 0),
(100, '4а', 0),
(101, '4б', 0),
(102, '4в', 0),
(103, '4г', 0),
(104, '4д', 0),
(105, '4е', 0),
(106, '4ё', 0),
(107, '4ж', 0),
(108, '4з', 0),
(109, '4и', 0),
(110, '4й', 0),
(111, '4к', 0),
(112, '4л', 0),
(113, '4м', 0),
(114, '4н', 0),
(115, '4о', 0),
(116, '4п', 0),
(117, '4р', 0),
(118, '4с', 0),
(119, '4т', 0),
(120, '4у', 0),
(121, '4ф', 0),
(122, '4х', 0),
(123, '4ц', 0),
(124, '4ч', 0),
(125, '4ш', 0),
(126, '4ц', 0),
(127, '4ъ', 0),
(128, '4ы', 0),
(129, '4ь', 0),
(130, '4э', 0),
(131, '4ю', 0),
(132, '4я', 0),
(133, '5а', 0),
(134, '5б', 0),
(135, '5в', 0),
(136, '5г', 0),
(137, '5д', 0),
(138, '5е', 0),
(139, '5ё', 0),
(140, '5ж', 0),
(141, '5з', 0),
(142, '5и', 0),
(143, '5й', 0),
(144, '5к', 0),
(145, '5л', 0),
(146, '5м', 0),
(147, '5н', 0),
(148, '5о', 0),
(149, '5п', 0),
(150, '5р', 0),
(151, '5с', 0),
(152, '5т', 0),
(153, '5у', 0),
(154, '5ф', 0),
(155, '5х', 0),
(156, '5ц', 0),
(157, '5ч', 0),
(158, '5ш', 0),
(159, '5ц', 0),
(160, '5ъ', 0),
(161, '5ы', 0),
(162, '5ь', 0),
(163, '5э', 0),
(164, '5ю', 0),
(165, '5я', 0),
(166, '6а', 0),
(167, '6б', 0),
(168, '6в', 0),
(169, '6г', 0),
(170, '6д', 0),
(171, '6е', 0),
(172, '6ё', 0),
(173, '6ж', 0),
(174, '6з', 0),
(175, '6и', 0),
(176, '6й', 0),
(177, '6к', 0),
(178, '6л', 0),
(179, '6м', 0),
(180, '6н', 0),
(181, '6о', 0),
(182, '6п', 0),
(183, '6р', 0),
(184, '6с', 0),
(185, '6т', 0),
(186, '6у', 0),
(187, '6ф', 0),
(188, '6х', 0),
(189, '6ц', 0),
(190, '6ч', 0),
(191, '6ш', 0),
(192, '6ц', 0),
(193, '6ъ', 0),
(194, '6ы', 0),
(195, '6ь', 0),
(196, '6э', 0),
(197, '6ю', 0),
(198, '6я', 0),
(199, '7а', 0),
(200, '7б', 0),
(201, '7в', 0),
(202, '7г', 0),
(203, '7д', 0),
(204, '7е', 0),
(205, '7ё', 0),
(206, '7ж', 0),
(207, '7з', 0),
(208, '7и', 0),
(209, '7й', 0),
(210, '7к', 0),
(211, '7л', 0),
(212, '7м', 0),
(213, '7н', 0),
(214, '7о', 0),
(215, '7п', 0),
(216, '7р', 0),
(217, '7с', 0),
(218, '7т', 0),
(219, '7у', 0),
(220, '7ф', 0),
(221, '7х', 0),
(222, '7ц', 0),
(223, '7ч', 0),
(224, '7ш', 0),
(225, '7ц', 0),
(226, '7ъ', 0),
(227, '7ы', 0),
(228, '7ь', 0),
(229, '7э', 0),
(230, '7ю', 0),
(231, '7я', 0),
(232, '8а', 0),
(233, '8б', 0),
(234, '8в', 0),
(235, '8г', 0),
(236, '8д', 0),
(237, '8е', 0),
(238, '8ё', 0),
(239, '8ж', 0),
(240, '8з', 0),
(241, '8и', 0),
(242, '8й', 0),
(243, '8к', 0),
(244, '8л', 0),
(245, '8м', 0),
(246, '8н', 0),
(247, '8о', 0),
(248, '8п', 0),
(249, '8р', 0),
(250, '8с', 0),
(251, '8т', 0),
(252, '8у', 0),
(253, '8ф', 0),
(254, '8х', 0),
(255, '8ц', 0),
(256, '8ч', 0),
(257, '8ш', 0),
(258, '8ц', 0),
(259, '8ъ', 0),
(260, '8ы', 0),
(261, '8ь', 0),
(262, '8э', 0),
(263, '8ю', 0),
(264, '8я', 0),
(265, '9а', 0),
(266, '9б', 0),
(267, '9в', 0),
(268, '9г', 0),
(269, '9д', 0),
(270, '9е', 0),
(271, '9ё', 0),
(272, '9ж', 0),
(273, '9з', 0),
(274, '9и', 0),
(275, '9й', 0),
(276, '9к', 0),
(277, '9л', 0),
(278, '9м', 0),
(279, '9н', 0),
(280, '9о', 0),
(281, '9п', 0),
(282, '9р', 0),
(283, '9с', 0),
(284, '9т', 0),
(285, '9у', 0),
(286, '9ф', 0),
(287, '9х', 0),
(288, '9ц', 0),
(289, '9ч', 0),
(290, '9ш', 0),
(291, '9ц', 0),
(292, '9ъ', 0),
(293, '9ы', 0),
(294, '9ь', 0),
(295, '9э', 0),
(296, '9ю', 0),
(297, '9я', 0),
(298, '10а', 0),
(299, '10б', 0),
(300, '10в', 0),
(301, '10г', 0),
(302, '10д', 0),
(303, '10е', 0),
(304, '10ё', 0),
(305, '10ж', 0),
(306, '10з', 0),
(307, '10и', 0),
(308, '10й', 0),
(309, '10к', 0),
(310, '10л', 0),
(311, '10м', 0),
(312, '10н', 0),
(313, '10о', 0),
(314, '10п', 0),
(315, '10р', 0),
(316, '10с', 0),
(317, '10т', 0),
(318, '10у', 0),
(319, '10ф', 0),
(320, '10х', 0),
(321, '10ц', 0),
(322, '10ч', 0),
(323, '10ш', 0),
(324, '10ц', 0),
(325, '10ъ', 0),
(326, '10ы', 0),
(327, '10ь', 0),
(328, '10э', 0),
(329, '10ю', 0),
(330, '10я', 0),
(331, '11а', 0),
(332, '11б', 0),
(333, '11в', 0),
(334, '11г', 0),
(335, '11д', 0),
(336, '11е', 0),
(337, '11ё', 0),
(338, '11ж', 0),
(339, '11з', 0),
(340, '11и', 0),
(341, '11й', 0),
(342, '11к', 0),
(343, '11л', 0),
(344, '11м', 0),
(345, '11н', 0),
(346, '11о', 0),
(347, '11п', 0),
(348, '11р', 0),
(349, '11с', 0),
(350, '11т', 0),
(351, '11у', 0),
(352, '11ф', 0),
(353, '11х', 0),
(354, '11ц', 0),
(355, '11ч', 0),
(356, '11ш', 0),
(357, '11ц', 0),
(358, '11ъ', 0),
(359, '11ы', 0),
(360, '11ь', 0),
(361, '11э', 0),
(362, '11ю', 0),
(363, '11я', 0);

-- --------------------------------------------------------

--
-- Структура таблицы `homeworks`
--

CREATE TABLE `homeworks` (
  `id` int(11) NOT NULL,
  `title` text NOT NULL,
  `description` text NOT NULL,
  `date_end` bigint(20) NOT NULL,
  `timetable_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `schools`
--

CREATE TABLE `schools` (
  `id` int(11) NOT NULL,
  `uid` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `timetable`
--

CREATE TABLE `timetable` (
  `id` int(11) NOT NULL,
  `number` int(11) NOT NULL,
  `time` bigint(20) NOT NULL,
  `title` text NOT NULL,
  `cabinet` text NOT NULL,
  `class_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `_id` int(11) NOT NULL,
  `uid` text NOT NULL,
  `first_name` text NOT NULL,
  `middle_name` text NOT NULL,
  `last_name` text NOT NULL,
  `school_number` int(11) NOT NULL,
  `school_class` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `classes`
--
ALTER TABLE `classes`
  ADD PRIMARY KEY (`_id`);

--
-- Индексы таблицы `homeworks`
--
ALTER TABLE `homeworks`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `schools`
--
ALTER TABLE `schools`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `timetable`
--
ALTER TABLE `timetable`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`_id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `classes`
--
ALTER TABLE `classes`
  MODIFY `_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=364;

--
-- AUTO_INCREMENT для таблицы `homeworks`
--
ALTER TABLE `homeworks`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `schools`
--
ALTER TABLE `schools`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `timetable`
--
ALTER TABLE `timetable`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `_id` int(11) NOT NULL AUTO_INCREMENT;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*
if has uid - тянем пользователя
else - тянем справочники и создаем пользователя
*/

---------------------------------------------------------------
-- выбрать данные пользователя
select u.`_id`,
       u.`uid` text,
       u.`first_name`,
       u.`middle_name`,
       u.`last_name`,
       u.`school_link_class_id`,
       s.`name` as school_name,
       c.`name` as class_name
from user u,
     school_link_class slc,
     school s,
     class c
where u.uid = #uid
  and u.school_link_class_id = slc.school_link_class_id
  AND slc.school_id = s.school_id
  AND slc.class_id = c.class_id;

---------------------------------------------------------------
-- TODO хранить локально?
-- старт приложения
SELECT school_id,
       name
FROM school;

SELECT class_id,
       name
FROM class;

-- json на создание пользователя
{
  'uid': '',
  'first_name' : '',
  'middle_name' : '',
  'last_name' : '',
  'school_id' : '',
  'class_id' : ''
};

-- json ответ на любой запрос
{
    code : 0,
    message : '',
    #`USER_DATA` (school_link_class_id)
};

-- создать пользователя
select scl.school_link_class_id
into l_school_link_class_id
from school_link_class slc
where slc.school_id= #school_id
  AND slc.class_is = #class_id;

INSERT INTO user(`uid`, `first_name`, `middle_name`, `last_name`, `school_link_class_id`);
VALUES(#uid, #first_name, #middle_name, #last_name, l_school_link_class_id);

---------------------------------------------------------------
-- получить рассписание (school_link_class_id)

-- сохранить рассписание (school_link_class_id)

---------------------------------------------------------------

---------------------------------------------------------------
-- получить домашку (school_link_class_id)
{
  'school_link_class_id'  : '',
  'stamp' : ''
};

select hw.*
from timetable tt,
     homework hw,
where tt.school_link_class_id = #school_link_class_id
  AND tt.temi > stamp
  AND tt.time < stamp + 1
  and hw.timetable_id = tt.timetable_id;

-- сохранить домашку (school_link_class_id)

---------------------------------------------------------------
